			<Table width = "100%" id = "main-background">	
			<td style = "vertical-align:top; padding-left:20px;"> <a href = "pascal.html"> <img src = "img/home.png" width = "16" height = "16"> </a> >  <a href = "pascal_lesson_1_1.html"> Урок 1 (Вы здесь) </a> > <a href = "pascal_lesson_2_2.html"> Урок 2  </a> > </td>																
				<TR height = "20" width = "100%" align = "center" >
					<TD>
						<h1> Функции write() и read() </h1>
						
					</td>	
				 <td> <img src = "img/l1.png" width = "150" height = "130"> </a> </td>	
					
				</TR>
				<TR height = "30%">
					<TD>
<p> Решим такую задачу - Напишите программу, которая возводит введенное число в степень 10, используя только четыре операции умножения. </p>
 <h3> Описание типа данных переменных и считывание числа с клавиатуры: </h3>
<textarea id = "code-frame" readonly style = "height:100px">
var a,b: real; // Присваиваем переменным a и b тип real (вещественный тип)
BEGIN
  write ('Введите число ');
  readln(a); </textarea>


					</td>
				</tr>
				<tr>
					<td>
						<h3> Возводим число в 10 степень и выводим ответ: </h3>
						<textarea id = "code-frame" readonly style = "height:110px;">
b:=a*a;
b:=b*b;
b:=b*a;
b:=b*b;
write(b);
end. </textarea>
						<p> Вот еще задачка - Используя только символы '-','_','|' напишите программу, которая выведет Tipo - Learn в рамке. </p>

						<textarea id = "code-frame" readonly style = "height:230px;">
uses crt;
begin
write (' ______________________________________________________________________________ ');
write ('|-_________--______-------------------------------------------____-------------|');
write ('|-|_______|--|_____|-_-___----___-------_-----____-----------|---|-------------|');
write ('|----|-|------|-|---|-|--|---|---|-----|-|----|--------/\----|---|---|\----|---|');
write ('|----|-|------|-|---|-|__|---|---|-----|-|__--|___----/__\---|___|---|-\---|---|');
write ('|----|-|------|-|---|-|------|---|-----|-|__|-|------/____\--|\----- |--\--|---|');
write ('|----|_|-----_|_|_--|_|------|___|-----|____|-|___--/------\-|-\-----|---\-|---|');
write ('|-----------|_____|------------------------------------------|--\----|----\|---|');
write ('|______________________________________________________________________________|');
end.
						</textarea>
<li> Кстати, окно 'uses crt' имеет размеры 80х25</li>
<br>
					</td>
				</tr>
			</table>